#!/usr/bin/python3
# -*- coding: utf-8 -*-
# Name: 111
# Author: 简
# Time: 2019/5/21

"""
代码  浏览器  交互   1、打开浏览器 2 、访问url 3、 请点击某一个元素  输入XXXX

代码  --  驱动程序(桥梁)  --- 浏览器(ie、google\firfox)
selenium - 代码库

# 77,68,56,59   10年 你
# 版本匹配   chromedriver

<> </>  xml  存储数据  标签对
<> </>  html  描述网页   标准 - 内容表达都已定义好  图片、文本、输入框、按钮
标签对

元素：<起始标签名 属性名称=属性值> 文本内容 </结束标签名>   --- 元素名称，代表某一类型的内容表达。

元素共同的属性：id - 唯一标识  在当前整个html
                class - 类别   给元素打标识  有很多元素有同样的class值。不是唯一的。
                style - 内联样式设置

                name - 很多元素都可以有。




下节预告：javascrip DOM 与页面交互 。
"""

